import Card from '@/components/Card';
import Badge from '@/components/Badge';

export default function Page() {
  return (
    <div>
      <p className="my-4">تم العثور على 250 نتيجة</p>
      <div className="my-2">
        <Badge title="الأحدث" />
        <Badge title="الأشهر" />
        <Badge title="الأقدم" />
      </div>
      <Card
        title="أقوال وحكم عربية"
        description="ذو العقل يشقى في النّعيم بعقلهِ، وأخو الجهالة في الشقاوة ينعم. النّاجح يبحث عن الحلول، أما الفاشل فيبحث عن الأعذار. النّاجح جزء من الحل، أما الفاشل فهو جزء من المشكلة. النّاجح لديه خطة وبرنامج، أما الفاشل فلديه تبريرات. يقول النّاجح دعني أقوم بالعمل، أما الفاشل فيقول هذا ليس"
        image="/demo.png"
        footer={true}
      />
      <Card
        title="أقوال وحكم عربية"
        description="ذو العقل يشقى في النّعيم بعقلهِ، وأخو الجهالة في الشقاوة ينعم. النّاجح يبحث عن الحلول، أما الفاشل فيبحث عن الأعذار. النّاجح جزء من الحل، أما الفاشل فهو جزء من المشكلة. النّاجح لديه خطة وبرنامج، أما الفاشل فلديه تبريرات. يقول النّاجح دعني أقوم بالعمل، أما الفاشل فيقول هذا ليس"
        image="/demo.png"
        footer={true}
      />
      <Card
        title="أقوال وحكم عربية"
        description="ذو العقل يشقى في النّعيم بعقلهِ، وأخو الجهالة في الشقاوة ينعم. النّاجح يبحث عن الحلول، أما الفاشل فيبحث عن الأعذار. النّاجح جزء من الحل، أما الفاشل فهو جزء من المشكلة. النّاجح لديه خطة وبرنامج، أما الفاشل فلديه تبريرات. يقول النّاجح دعني أقوم بالعمل، أما الفاشل فيقول هذا ليس"
        image="/demo.png"
        footer={true}
      />
      <Card
        title="أقوال وحكم عربية"
        description="ذو العقل يشقى في النّعيم بعقلهِ، وأخو الجهالة في الشقاوة ينعم. النّاجح يبحث عن الحلول، أما الفاشل فيبحث عن الأعذار. النّاجح جزء من الحل، أما الفاشل فهو جزء من المشكلة. النّاجح لديه خطة وبرنامج، أما الفاشل فلديه تبريرات. يقول النّاجح دعني أقوم بالعمل، أما الفاشل فيقول هذا ليس"
        image="/demo.png"
        footer={true}
      />
      <Card
        title="أقوال وحكم عربية"
        description="ذو العقل يشقى في النّعيم بعقلهِ، وأخو الجهالة في الشقاوة ينعم. النّاجح يبحث عن الحلول، أما الفاشل فيبحث عن الأعذار. النّاجح جزء من الحل، أما الفاشل فهو جزء من المشكلة. النّاجح لديه خطة وبرنامج، أما الفاشل فلديه تبريرات. يقول النّاجح دعني أقوم بالعمل، أما الفاشل فيقول هذا ليس"
        image="/demo.png"
        footer={true}
      />
    </div>
  );
}
