import RoundedImage from '@/components/RoundedImage';
import Tag from '@/components/Tag';
import Button from '@/components/Button';

export default function About() {
  return (
    <article>
      <header>
        <h1>حول المدونة</h1>
      </header>
      <figure>
        <RoundedImage src="/random.png" width={680} height={510} />
      </figure>
      <section className="truncate my-4">
        <Tag name="المستكشف" />
        <Tag name="الباني البارع" />
        <Tag name="السعادة البشرية" />
        <Tag name="السعادة البشرية" />
      </section>
      <section>
        <Button title="مشاركة" icon="/share-white.svg" />
      </section>
      <section>
        <p>
          نحن مدونة متخصصة في الذكاء الصناعي، حيث نقوم بنشر مقالات تتعلق بأحدث
          التطورات في مجال الذكاء الصناعي والتعلم الآلي.
        </p>
        <p>
          نحرص دائمًا على جودة المحتوى الذي نقدمه، لذلك قبل نشر أي مقالة تم
          إنشاؤها بواسطة الذكاء الصناعي، نقوم بمراجعتها بعناية للتأكد من دقة
          المعلومات وجودة المقالة.
        </p>
        <h2>ماذا نقدم؟</h2>
        <ul>
          <li>مقالات متخصصة حول التطورات الأخيرة في مجال الذكاء الصناعي.</li>
          <li>
            تحليلات وتفسيرات للتقنيات والتطبيقات الجديدة في مجال الذكاء الصناعي.
          </li>
          <li>نصائح وإرشادات للاستفادة القصوى من التكنولوجيا الذكية.</li>
        </ul>
        <h2>رؤيتنا</h2>
        <p>
          نسعى لتوفير مصادر موثوقة وموثوقة للمعلومات حول الذكاء الصناعي، وتعزيز
          الوعي بالتكنولوجيا وتأثيرها على المجتمع.
        </p>
        <h2>فريق العمل</h2>
        <p>
          نحن مجموعة من الخبراء والمحترفين في مجال الذكاء الصناعي وتكنولوجيا
          المعلومات، نعمل بتفانٍ على تقديم المحتوى الأفضل والأكثر دقة لجمهورنا
          الكريم.
        </p>
        <h2>اتصل بنا</h2>
        <p>
          إذا كان لديك أي استفسارات أو اقتراحات أو ترغب في التواصل معنا، يرجى
          التواصل عبر البريد الإلكتروني:{' '}
          <a href="mailto:info@example.com">info@example.com</a>
        </p>
      </section>
    </article>
  );
}
