const CookiesPolicy = () => {
  return (
    <article>
      <h1>عنوان</h1>
      <p className="dark:text-dark-onSurfaceVariant">
        كن يجب أن أشرح لك كيف ولدت كل هذه الفكرة الخاطئة المتمثلة في إدانة
        السرور ومدح الألم ، وسأقدم لك وصفًا كاملاً للنظام ، وأشرح التعاليم
        الفعلية للمستكشف العظيم للحقيقة ، الباني البارع.عادة البشرية. لا أحد
        يرفض أو يكره أو يتجنب المتعة نفسها ، لأنها متعة ، ولكن لأن أولئك الذين
        لا يعرفون
      </p>
      <h2 className="mt-3"> ff2 عنوان</h2>
      <p className="dark:text-dark-onSurfaceVariant">
        كن يجب أن أشرح لك كيف ولدت كل هذه الفكرة الخاطئة المتمثلة في إدانة
        السرور ومدح الألم ، وسأقدم لك وصفًا كاملاً للنظام ، وأشرح التعاليم
        الفعلية للمستكشف العظيم للحقيقة ، الباني البارالبشرية. لا أحد يرفض أو
        يكره أو يتجنب المتعة نفسها ، لأنها متعة ، ولكن لأن أولئك الذين لا يعرفون
      </p>
    </article>
  );
};

export default CookiesPolicy;
